"modes": [
    {
        "gameMode": "CLASSIC",
        "description": "Classic Summoner's Rift and Twisted Treeline games\nOn both Classic maps, the primary goal is to destroy the enemy Nexus. Defending each Nexus are several turrets and inhibitors; each structure must be destroyed in sequence (one cannot skip straight to the Nexus). There are many ways to destroy turrets: making use of the automatic minions to take the brunt of the turret's fire or focusing it with several teamates while a tank draws aggro are a few of the many methods of destroying turrets while minimizing casualties. After the turrets have been destroyed, the inhibitors defend the Nexus. They do not attack but are a vital part of winning. Destroying them will allow their respective lane to spawn super minions, powerful beings that can crush ordinary minions and even champios with ease.\nSummoner's Rift - A Field that draws inspiration from the Defense of the Ancients: Allstars (often shortened to DotA) version of the map, with several tweaked features and mechanics. The game consists of five summoners on each team, who are pitted against each other in an attempt to destroy the enemy Nexus and win. The general time it takes to complete a game ranges from 35–50 minutes."
        "url": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/league-of-legends/2/22/New_Rift.jpg"
    },
    {
        "gameMode": "ARAM",
        "description": "ARAM games\nARAM, abbreviation of All Random, All Mid, is a game mode in League of Legends in a 5v5 format on the Howling Abyss icon Howling Abyss, where the objective is to destroy the opposing team's Nexus. The game includes an Reroll All random draft type, and a game that takes place only on one long lane (specifically referencing its resemblance to Summoner's Rift icon Summoner's Rift's middle lane).In ARAM, players are given random champions from the available champion pool and are able to trade or reroll their picks.\nBefore its introduction on June 29, 2012, the mode was a popular spin on Summoner's Rift Custom Game icon Custom games (where it was often played as ARAM) or Dominion (where it was often played as ARAB) in which players agreed to deliberately focus on 5v5 fights in a single lane, most often the middle lane for Summoner's Rift (as it was the shortest) and the bottom half of the map for Dominion (by community consensus), with gameplay mainly focused on fighting and buying items until either team wins. After a Thunderdome event, the Proving Grounds map was revamped from being used solely for the game's first original tutorials, to a playable Custom game map, which players used for this purpose. Eventually, the Howling Abyss replaced Proving Grounds (for the tutorials included, up until their removal and release of the modern tutorial) for this game type, and ARAM was released as an official queue on the Howling Abyss map in Patch 3.6.\n\nEach side of the Howling Abyss icon Howling Abyss has two lane turrets, two patches of brushes, two health relics, one inhibitor, two nexus turrets, a nexus and a shopkeeper. The map was replaced with Butcher's Bridge during Bilgewater events (Burning Tides, Curse of the Drowned).\nThere is only one lane.\n\nThere are only two turrets protecting the inhibitor and two turrets protecting the nexus.\n\nChampions deal 0% − 25% (based on minutes) bonus damage to structures after 18:00.\n\nThere is a base gate that blocks champions from leaving the base for the first 15 seconds.\n\nAfter these base gates have fallen, there will be frost-gates that are spawned in front of each team's Nexus.\n\nChampions can interact with these gates to initiate Frostgate Warp, causing them to Channeling icon channel for 0.75 seconds. Upon completion, they Dash dash to the other side of the gate over 2.25 seconds, during which they are Untargetable icon untargetable and Lockout icon 2 unable to act. If the channel is interrupted, the gate will be placed on a 1.5-second cooldown. They may also choose a location to dash another time up to a distance away from the gate upon reaching their destination. Frost-gates have a 15-second cooldown after being activated.\n\nLeading gates cannot be interacted with and are located in front of the outer turret.\n\nIf the outer turret is destroyed, the leading gate is relocated to the front of the inhibitor turret.\n\nFrost-gates on both sides of the map can be interacted with by champions regardless of which team they are on.\n\nThere are 4 health relics positioned in front of the outer towers, with 2 relics on each team's respective side of the map.\n\nRestores 8% of missing health and 8% of missing mana to the champion who picks up the relic.\n\nAfter being picked up, triggers a beam of light to strike the ground after 2.5 seconds, restoring 16% of missing health and 16% of missing mana for all champions within.\n\nRecall Recall is disabled, however, the channel's animation will still play.\n\nThe fountain does not grant any restoration effects to champions.\n\nThe shop will be disabled after champions have moved too far away from the fountain. It will be enabled after death.\n\nThe range at which the shop becomes disabled is a slight distance away from the Nexus turrets.\n\nUnanimous Surrender is enabled at 8:00.\n\nSurrender is enabled at 12:00.\n\nMinions\n\nMinions take 75% damage from AoE damage.\n\nMinion waves spawn every 25 − 13 (based on minutes) seconds.\n\nMinions have 325 − 425 (based on minutes) movement speed.\n\nSiege minions spawn every two waves, starting with the third wave.\n\nSiege minions and super minions are empowered by Blackout.\n\nPASSIVE EFFECT - BLACKOUT: When there is a Noxious Trap stealthed trap nearby, gain Blackout, True Sight icon revealing and Exposed icon exposing all stealthed \n\ntraps within 1100 units. Blackout lingers for 4 seconds after there are no longer any traps nearby."
        "url": "https://5mid.com/wp-content/uploads/2017/04/aram.jpg"
    },
    {
        "gameMode": "TUTORIAL",
        "description": "The Tutorial is a type of game in which the player is guided to learn the basis and more complex concepts of the League of Legends gameplay. The player is set with bots as allies and enemies instead of other players.\n\nSeason Eight introduced three new tutorials on Summoner's Rift. You have to complete the first one to unlock the second, and complete the second one to unlock the third. Finishing each step grants the player XP 150. The reward for finishing all three is a capsule containing 3000 BE 3000."
        "url": "https://static.wikia.nocookie.net/leagueoflegends/images/d/dc/Tutorial_push_foward.png/revision/latest?cb=20181116174605"
    },
    {
        "gameMode": "U.R.F",
        "description": "Ultra Rapid Fire (U.R.F.) is a Featured Game Mode played on Summoner's Rift icon Summoner's Rift where all champions are able to use their abilities and spells very frequently and without costs, accelerating the pace of the match. All champions in this mode have a permanent buff that adds many adjustments to how the game is played. The two main effects granted by this buff are 300 ability haste (equivalent to 75% cooldown reduction) and the removal of all mana and energy costs from abilities.\n\nFeatures\n\nMap: Summoner's Rift icon Summoner's Rift\n\nDraft: Reroll All Random (ARURF) or Blind Pick\n\nFeatures:\n\nAwesome Buff of Awesomely Awesome Buffing AWESOME BUFF OF AWESOMELY AWESOME BUFFING e\n\nEffects: (Updated as of ARURF 2022)\n\nMana icon Mana and Energy icon Energy consumption reduced by 100%.\n\nHealth resource Health costs reduced by 50%.\n\n+300 Cooldown reduction icon ability haste, summoner spell haste, and item haste.\n\n+25% Tenacity icon tenacity.\n\nMovement speed icon 60 bonus movement speed.\n\nAttack speed icon Bonus attack speed is multiplied by (Melee role 1.5 / Ranged role 2).\n\nCritical strike icon Critical strikes deal 25% additional damage.\n\nChampions that use mana convert 35% of bonus mana into bonus health, and 100% of bonus mana regeneration into bonus health regeneration.\n\nThe following buffs are specific to the Champion icon champion when applicable:\n\nThis unit deals X% of its normal damage.\n\nThis unit receives X% of its normal damage.\n\nNotes\n\nAbility haste from other sources stack with the URF bonus.\n\nHeal Embargo Heal Embargo e: Direct Heal power icon healing effects are only 50% effective at the beginning of the game, increasing by 1% every 30 seconds, up to 100% effectiveness at 25 minutes.\n\nShield Overload Shield Overload e: The strength of non-ultimate Hybrid resistances icon shields is reduced by 30%.\n\nChampion Cannon URF Render Champion cannon: A cannon outside each team's fountain will be present for friendly Champion icon champions to select. Dash Jumping inside the cannon renders the unit Hallucinate vanished, and staying in for more than 10 seconds forces them out. Units have a larger field of view of the map and can Dash launch themselves with Unstoppable icon displacement immunity to a target location of their choice, up to a maximum range. A circular indicator visible to all units will be placed on that specific location. Upon impact, all enemies within the area take 120 − 460 (based on level) magic damage and are knocked Airborne icon airborne.\n\nMinion gold: When nearby Minion icon minions die, champions receive an amount of gold Gold gold regardless of whether they scored the last hit or not. \n\nAdditionally, last hitting a minion grants more gold.\n\nCaster minions Caster minions are worth 19 19.6.\n\nMelee minions Melee minions are worth 29 29.4.\n\nSiege minions Siege minions are worth 84 Gold 84.\n\nHigher level cap: The level cap is increased to level 30.\n\nEarly surrender: Can now unanimously surrender at 8 minutes, or surrender normally at 10 minutes.\n\nEarly homeguard: Homeguard is enabled from the start of the match.\n\nTurret Plating Turret Plating disintegrates at 8:00 instead of 14:00.\n\nTurret plate health changed to 500 - 1500, based on the plate.\n\nTurret plate gold increased to 300 Gold 300.\n\nItem changes:\n\nCull Cull\n\nDisabled.\n\nDark Seal Dark Seal / Mejai's Soulstealer Mejai's Soulstealer\n\nDisabled.\n\nSpoils of War (Relic Shield Relic Shield, Spectral Sickle Spectral Sickle, Spellthief's Edge Spellthief's Edge, Steel Shoulderguards Steel Shoulderguards)\n\nDisabled.\n\nWatchful Wardstone Watchful Wardstone / Vigilant Wardstone Vigilant Wardstone\n\nDisabled.\n\nSummoner Spell changes:\n\nSmite Smite\n\nCharge rate reduced to 30 seconds from 75 seconds.\n\nCooldown between charges reduced to 10 seconds from 15 seconds.\n\nTeleport Teleport\n\nDisabled.\n\nJungle changes:\n\nDragon Dragon\n\nInitial spawn time reduced to 4 minutes.\n\nRespawn time reduced to 2 minutes and 30 seconds.\n\nHealth is dramatically increased.\n\nBaron Nashor Baron Nashor\n\nInitial spawn time reduced to 10 minutes.\n\nRespawn time reduced to 5 minutes.\n\nHealth is dramatically increased.\n\nGrants both the Hand of Baron Hand of Baron and spawns a Eye of the Herald Eye of the Herald when slain."
        "url": "https://nexus.leagueoflegends.com/wp-content/uploads/2019/10/LOL_CMS_308_Tile_01-Feature_H50-V50-min_jofavih5pb7yykeo8rcm.jpg"
    },
    {
        "gameMode": "DOOM BOTS",
        "description": "The Doom Bots of Doom, also known as Nightmare mode, is a Featured Game Mode for League of Legends. The first featured mode to utilize bots, this is Co-op vs. AI with a twist: each bot has mutated, granting them empowered abilities. On higher difficulties, Doom Bots will mutate further over the course of the game - picking up the abilities of other champions, alongside their own.\n\nGame flow\n\nBattle against the Doom Bots of Doom on an extra spooky Summoner's Rift in this survival style game mode. Doom Bots will rush your lanes relentlessly. Survive! \n\nTry to survive for 15 minutes until The Evil Overlord of the Doom Bots The Evil Overlord of the Doom Bots is summoned. Defeat him to win the game!\n\nLose your nexus and be doomed forever...\n\nOther gameplay notes\n\nDoom bots don't go back to shop or heal, but when they do die they'll be back in lane before you know it. The map has been cut in half so we could double down on the doom. Enemy towers are invulnerable. Don't bother trying to push.\n\nIn the event you manage to suicide some minions into an enemy tower, you'll receive burst of HP/mana for some sustain.\n\nUpon breaking certain kill 'quest' thresholds, your team will receive a boost in power. Work together to get kills and power up in time.\n\nDifficulties\n\nCustom difficulty in 'The Gauntlet' mode:\n\nIn 'The Gauntlet', we're letting YOU set the difficulty and choose how hard you want the Doom Bots to be when challenging them.\n\nSet a custom Doom Bots difficult from 1 - 100 at the start of the game to modify your Doom Bots.\n\nUse the chat command '/votelevel ##' and have 3 or more players vote for the same difficulty level to lock it in. (EG: /votelevel 65)\n\nIf a difficulty is not agreed on and voted for within 90sec, the mode will randomise a difficulty level.\n\nOn completion, your match history will show what level you completed as PROOF of your accomplishment (or demise).\n\nSpecial Icons will be rewarded after the event for players that complete some of the highest possible levels compared to anyone else in the world.\n\nBot Roster\n\nAmumu Amumu\n\nDoom of the Sad Mummy\n\nIn addition to bonus stats, Doom Amumu also:\n\nShares his Despair Despair with nearby minions\n\nHas a much larger Curse of the Sad Mummy Curse of the Sad Mummy\n\nIs still quite sad\n\nAnnie Annie\n\nDoom of the Dark Child Doom of the Dark Child\n\nIn addition to bonus stats, Doom Annie also:\n\nAutomatically Disintegrates Disintegrates nearby minions\n\nIncinerates Incinerates units in a circle around her\n\nSummons Tibbers Tibbers when she dies, who will be quite angry\n\nLikes her teddy bear\n\nBlitzcrank Blitzcrank\n\nDoom of the Great Steam Golem Doom of the Great Steam Golem\n\nIn addition to bonus stats, Doom Blitzcrank also:\n\nCasts triple Rocket Grab Rocket Grab\n\nConstantly goes into Overdrive Overdrive\n\nHas a much larger radius on Static Field Static Field's active\n\nHas a heart... ?\n\nBrand Brand\n\nDoom of the Burning Vengeance\n\nIn addition to bonus stats, Doom Brand also:\n\nCreates multiple Pillars of Flame Pillars of Flame around targets\n\nIs on fire\n\nLooks mean\n\nCho'Gath Cho'Gath\n\nDoom of the Terror of the Void\n\nIn addition to bonus stats, Doom Cho'Gath also:\n\nPassively gains Feast Feast stacks\n\nCreates multiple Ruptures Ruptures based on his size\n\nAirborne icon Knocks back units hit by Feral Scream Feral Scream\n\nIs often hungry\n\nEzreal Ezreal\n\nDoom of the Prodigal Explorer\n\nIn addition to bonus stats, Doom Ezreal also:\n\nShoots multiple Mystic Shots Mystic Shots when cast\n\nShoots multiple Essence Fluxes Essence Fluxes when cast\n\nShoots a plethora of Trueshot Barrages Trueshot Barrages when cast\n\nDoes not need a map\n\nFiddlesticks Fiddlesticks\n\nDoom of the Harbinger (of Doom) Doom of the Harbinger (of Doom)\n\nIn addition to bonus stats, Doom Fiddlesticks also:\n\nDrains Drains HP from all nearby enemies when cast\n\nPeriodically spawns spectral clones that cast Crowstorm Crowstorm\n\nIs ironically bad at scaring crows crows\n\nGalio Galio\n\nDoom of the Sentinel's Sorrow\n\nIn addition to bonus stats, Doom Galio also:\n\nCasts Resolute Smite Resolute Smite in a circle around him\n\nCreates multiple Righteous Gusts Righteous Gusts in a line\n\nPeriodically spawns Taunt icon taunt zones near him\n\nFlies, sort of\n\nHeimerdinger Heimerdinger\n\nDoom of the Revered Inventor\n\nIn addition to bonus stats, Doom Heimerdinger also:\n\nPassively spawns H-28G Evolution Turrets H-28G Evolution Turrets near him\n\nCauses H-28G Evolution Turrets H-28G Evolution Turrets to shoot in multiple directions\n\nChanges Hextech Micro-Rockets Hextech Micro-Rockets to return along their trajectories\n\nModifies CH-2 Electron Storm Grenades CH-2 Electron Storm Grenades to fragment on detonation\n\nIs smarter than you are\n\nLeona Leona\n\nDoom of the Radiant Dawn Doom of the Radiant Dawn\n\nIn addition to bonus stats, Doom Leona also:\n\nShields nearby minions with Eclipse Eclipse when cast\n\nPassively generates Eclipses Eclipses near her\n\nCalls down massive Solar Flares Solar Flares\n\nPraises the sun\n\nLulu Lulu\n\nDoom of the Fae Sorceress\n\nIn addition to bonus stats, Doom Lulu also:\n\nPlaces up to five additional Pix, Faerie Companions Pix, Faerie Companions on nearby allies\n\nCauses all nearby Pixes Pixes to randomly cast Whimsy Whimsy when she does\n\nMakes all nearby allied champions grow when Wild Growth Wild Growth is cast\n\nKnows what colors taste like\n\nLux Lux\n\nDoom of the Lady of Luminosity\n\nIn addition to bonus stats, Doom Lux also:\n\nCreates starbursts of Light Bindings Light Bindings\n\nCauses Lucent Singularity Lucent Singularity to generate Light Bindings Light Bindings\n\nFires multiple Final Sparks Final Sparks in a circle around her\n\nReally likes laughing\n\nMalzahar Malzahar\n\nDoom of the Prophet of the Void Doom of the Prophet of the Void\n\nIn addition to bonus stats, Doom Malzahar also:\n\nConstantly opens portals portals to the Void profileicon Void\n\nPassively summons Void creatures Void creatures into lane\n\nIs originally from Shurima profileicon Shurima\n\nMorgana Morgana\n\nDoom of the Fallen Angel\n\nIn addition to bonus stats, Doom Morgana also:\n\nCreates additional Dark Bindings Dark Bindings when cast\n\nSpawns multiple Tormented Shadow Tormented Shadow areas around her\n\nAutomatically Flash Flash + Stasis icon Stasis when Soul Shackles Soul Shackles is cast\n\nStruggles with baking\n\nTristana Tristana\n\nDoom of the Yordle Gunner Doom of the Yordle Gunner\n\nIn addition to bonus stats, Doom Tristana also:\n\nSimultaneously attacks two targets\n\nPassively adds Explosive Charges Explosive Charges to minions hit\n\nAirborne icon Knocks back enemies when she lands a Rocket Jump Rocket Jump\n\nHas greatly increased Airborne icon knockback radius on Buster Shot Buster Shot\n\nTrains dragons dragons in her spare time\n\nUdyr Udyr\n\nDoom of the Spirit Walker\n\nIn addition to bonus stats, Doom Udyr also:\n\nPeriodically marks jungle camps as claimed\n\nSummons unkilled monsters from claimed camps into lane after a delay\n\nGuards spirits or whatever\n\nVeigar Veigar\n\nDoom of the Tiny Master of Evil\n\nIn addition to bonus stats, Doom Veigar also:\n\nPeriodically calls down Dark Matter Dark Matter around him\n\nHas increased range and no hit limit on Baleful Strike Baleful Strike\n\nIs really evil\n\nWukong Wukong\n\nDoom of the Monkey King\n\nIn addition to bonus stats, Doom Wukong also:\n\nCreates Decoys Decoys that Airborne icon knockback nearby enemies\n\nSpawns Decoys Decoys on units hit by Nimbus Strike Nimbus Strike\n\nCreates multiple spinning clones clones when Cyclone Cyclone is cast\n\nWill be the best\n\nYasuo Yasuo\n\nDoom of the Unforgiven\n\nIn addition to bonus stats, Doom Yasuo also:\n\nCreates several whirlwinds whenever Resolve expires\n\nCreates a whirlwind when projectiles are blocked by Wind Wall Wind Wall\n\nCreates clones that use Last Breath Last Breath when faraway enemies are Airborne icon Airborne\n\nIs sometimes a robot and sometimes a cowboy but never a robot cowboy\n\nYorick Yorick\n\nDoom of the Shepherd of Souls\n\nIn addition to bonus stats, Doom Yorick also:\n\nConstantly raises hordes of Mist Walkers Mist Walkers to fight alongside him\n\nPlays guitar\n\nHas a last name\n\nZiggs Ziggs\n\nDoom of the Hexplosives Expert\n\nIn addition to bonus stats, Doom Ziggs also:\n\nLeaves behind mines on Bouncings Bombs Bouncings Bombs\n\nCreates Mini Inferno Bombs around Mega Inferno Bomb's Mega Inferno Bomb's blast zone\n\nIs not the star this time"
        "url": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fblogoflegends.com%2Ffiles%2F2017%2F10%2Fimage-3.jpg"
    },
    {
        "gameMode": "ONE FOR ALL",
        "description": "One for All is a limited time game mode in League of Legends. Players battle in a 5v5 match in Summoner's Rift map similar to Classic mode, with the only difference being that all champions on each team are the same. The mode was first made available from 2013-11-02 to 2013-12-02. It is occasionally relaunched to align with April Fools' Day.\n\nOne for All games could also be created and played as a Custom Game at one point with the map choice not being limited to Summoner's Rift; all other maps could be chosen.\n\nThe process for selecting champions in One for All is called Vote Pick, which follows the Custom Game Iteration of Draft Pick.\n\nAt the beginning, each player can ban a champion, for up to 10 banned champions. Each player will then vote for a champion for the whole team to play. Players may pick any champion in their team's pool of champions (owned and free). If all players on a team or the strict majority (4 votes), pick the same champion, then that champion is played by all players on that team. In the case that no champion won a clear majority, a random champion will be assigned from the pool of votes.\n\n ONE FOR ALL: MIRROR MODE\n\n'Last time you tangoed with One for All, you could nuke the enemy team with five Final Sparks or chain together a series of Unstoppable Forces. Some teams even achieved immortality with back-to-back-to-back-to-back-to-back Chronoshifts.\n\nNow it's time for One For All: Mirror Mode! We've moved the action to the Howling Abyss and changed the rules so players on both teams clash with the same champ. Soon you'll really play pinball with Monsoons, dodgeball with Dark Spheres or hide-and-seek with ten times the Noxious Traps.\n\nFor this iteration of One For All, champ select is determined by the combined nominations of both teams. A vote tracker shows the nominated champions - if one champ achieves a strict majority, they're chosen. If not, we base the choice on a weighted random from all the nominated champs, so if four people vote for Amumu, three people pick Blitzcrank and the last three all pick different champs; there's a 40% chance everyone plays Amumu, a 30% chance everyone plays Blitz and a 10% chance for each of the remaining champs!\n\nAfter playing your first game, you'll permanently unlock the One For All icon (it'll take a few days to hit your account). Additionally, we've added a feature to One For All: Mirror Mode that allows you to purchase a Battle Boost for your team during champ select. If you purchase one (150 RP), you'll temporarily unlock all the chosen champ's currently available skins for yourself and your allies. Everyone on your team also gets a one-game 100 IP boost!\n\nThis game mode was inspired by feedback from you guys, so let us know what you think! One For All: Mirror Mode will be live from May 29 through June 8 and we'll be hanging out on the Community Beta looking for your thoughts and awesome ideas!'"
        "url": "https://i.ytimg.com/vi/6vPU3OmRl1M/maxresdefault.jpg"
    },
    {
        "gameMode": "ASCENSION",
        "description": "Ascension is a recurring temporary game mode originally made for the Shurima event available from September 10 to 25, 2014. On April 8, 2016, it was added to the list of Rotating Game Modes. It is exclusive to the Crystal Scar.\n\nA sandstorm rages around the Crystal Scar, significantly reducing vision. It is not possible to leave the fountain on foot. Instead, players must teleport onto one of the ports (originally the capture points in Dominion) via a game mode-exclusive trinket: the Golden Transcendence Golden Transcendence. First use of the trinket may be used 30 seconds after the players enter the game. Each team has the nearest center and lower ports exclusively and the top center port is open to both teams. In addition, recalling to base has been disabled, so players can't buy new items until they die and respawn at the fountain again. The outer circular lane of the Crystal Scar is not open. Players begin play at level 3, with 1300 Gold 1300 starting Gold and 56 Gold 56 per 10 seconds. Ascension features a Shuriman-themed user interface, which displays the team scores and the current Ascended. This mode uses all the items and champion changes of Dominion.\n\nAt the center of the map resides Xerath Xerath as an Ancient Ascendant: a stationary neutral monster. Killing him bestows the 'Ascension' buff, which significantly empowers its bearer. Champions can only ascend by killing the monster and not by killing another Ascended; the Ancient Ascendant must be slain again, who reappears shortly after the last Ascended champion dies.\n\nObjective\n\nThe first team to score 200 points wins:\n\nKilling enemy champions earns 1 point.\n\nIf a killer is Ascended, 2 points are earned.\n\nClaiming a Relic of Shurima earns 3 points.\n\nKilling an Ascended Champion rewards 5 points.\n\nKilling The Ancient Ascendant earns 5 points.\n\nRelics of Shurima\n\nThere are 3 Relics of Shurima in Ascension; top right, top left, and lower center in a circular pattern. Relics provide reveal for ~300 range and are over a speed boosting aura. Relics are captured by standing within 200 range of the item, right clicking, and waiting for the progress bar to deplete. If a capturing champion receives any non-DOT damage, is displaced, or moves willingly before the progress bar is depleted the relic will reset. Multiple champions can capture at the same time increasing the rate of capture. When multiple champs are capturing and one cancels his capture, his progress is maintained by the other capturing champions. Once a relic is capture, the map fog will conceal the area until it respawns ~30 seconds later.\n\nRewards\n\nThe Shurima event comes with special summoner icons if the player achieves a minimum number of wins or gets a perfect ascension game.\n\nWin one matchmade Ascension match to earn the Shuriman Acolyte icon.\n\nWin three matchmade Ascension matches to earn the Shuriman Master icon.\n\nWin five matchmade Ascension matches to earn the Shuriman Ascendant icon.\n\nWin an Ascension match wherein your team earns the Ascension buff at least once and the opposing team never earns the Ascension buff to earn the Perfect Ascension icon."
        "url": "https://static.wikia.nocookie.net/leagueoflegends/images/2/26/Ascension_mode.png/revision/latest?cb=20160626034251"
    },
    {
        "gameMode": "NEXUX SIEGE",
        "description": "Nexus Siege cuts the Rift in half, leaving just one base to raze/protect. If you're on the attack, blitz the base, shove waves, and deploy siege weapons to charge up your minions and destructify towers. When defending, break out tower upgrades and hold the line at all costs. Once the attackers crack the Nexus, teams switch sides. Victory goes to whichever team flattens the base fastest when attacking.\n\nSiege Weapons\n\nCrystal Shards\n\nSiege weapons fill summoner spell slots. Snatch them up with an alternate currency called CR iconCrystal Shards (CR). Each side earns this kind of CR a little differently:\n\nOffense Offense\n\nEarned over time\n\nKill enemy champions; attacker kills net more Crystal Shards than defender kills\n\nDefense Defense\n\nEarned over time\n\nKill enemy champions\n\nGranted when the first tower in each lane is destroyed\n\nEarned for each minion shoved into the attacker's teleporters\n\nDefenders start the round with enough Crystal Shards to buy a siege weapon"
        "url": "https://static.wikia.nocookie.net/leagueoflegends/images/b/b3/FGM_Nexus_Siege.png/revision/latest?cb=20170927152042"
    },
    {
        "gameMode": "ASSASSINATE HUNT OF THE BLOOD",
        "description": "Hunt of the Blood Moon is a Featured Game Mode for League of Legends that goes inconjunction with The Blood Moon festival. Two teams of Assassins compete, sacrificing the opposition in an attempt to secure the Blood Moon's blessing and briefly gain the power of a demon. The team most successful in gaining said favor wins. It is the first game mode to incorporate a limited champion pool.\n\nMechanics\n\nAll champions start at level 3 and will be affected by the BLOOD PACT, granting 50% cooldown reduction on active items and summoner's spells, and while out-of-combat, also grants increased movement speed, mana regeneration, and ultimates cooling down faster.\n\nThe game begins with no outer turrets. At the 6 minute mark, the inner turrets will collapse as well.\n\nLane minion spawns have been disabled, and turrets are invulnerable.\n\nGold and experience are flatlined, and respawn timers are reduced across the board.\n\nPassive gold generation is about 221 Gold 221 per 10 seconds and only starts at 1:00.\n\nPassive experience earned is about 18 experience per second, starts at the beginning of the game.\n\nChampion kills grant no additional experience.\n\nMost defensive items have been removed from the shop.\n\nFirst team to obtain 350 points wins. There are 3 ways to earn points:\n\nKilling an enemy champion grants 5 points.\n\nKilling an enemy Spirit will grant 3 points. Spirits of the Blood Moon will passively filter into both teams jungles. Damaging spirits causes them to Flee icon flee from you.\n\nMinimap indicators in both teams' jungles will light up to indicate the number of spirits in that half of the jungle. A maximum of 8 will spawn at a time.\n\nDemon Heralds will periodically spawn in both sides (Baron Baron and Dragon Dragon pit). Killing a Demon Herald grants 25 points.\n\nYou gain a stack each time you kill an enemy champion or spirit, up to 3 stacks. Returning to base or dying removes all stacks. Upon reaching 3 stacks, being out of combat for 4 seconds consumes all stacks to render you Cosmic Radiance invulnerable and unable to cast abilities for 1 second, as well as Untargetable icon untargetable for the remaining 0.75 seconds. After 0.6 seconds into the duration, you Heal power icon heal for 100% maximum health and gain the DEMON BRAND buff, which grants Twilight Shroud old2 invisibility, increased movement speed, and empowers your next basic attack to deal 20% of the first target's maximum health bonus true damage. Lasts for 45 seconds or until your next basic attack or ability cast."
        "url": "https://cdn.vox-cdn.com/thumbor/j51GscOaa9pRuhn0x8aGwDlgSUo=/1400x0/filters:no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/7963257/rift.jpg"
    },
    {
        "gameMode": "DARK STAR",
        "description": "Dark Star: Singularity is a temporary game mode that first occurred from May 4th to 15th, 2017.\n\nPlay as Thresh Thresh to hook and flay your enemies into the Dark Star and feed it souls, helping Thresh Thresh cause the Singularity and end the universe!\n\nPLAYERS: 3v3\n\nMAP: Cosmic Ruins\n\nMODE TYPE: No picks. Everyone plays Dark Star Thresh Dark Star Thresh (with slightly modified abilities).\n\nCosmic Death Sentence Cosmic Death Sentence\n\nRange massively increased, cooldown reduced and mana cost removed.\n\nPulls enemies much farther based on their missing health.\n\nIf you throw a Death Sentence through the center of the Dark Star, it lights on fire and deals 250 bonus true damage to the target.\n\nWhile an enemy is bound by your Death Sentence, you are immune to that enemy's Death Sentence.\n\nYou can dash through the Dark Star if you grab someone across the star.\n\nGravitational Dark Passage Gravitational Dark Passage\n\nShield removed, cooldown increased and mana cost removed.\n\nLantern duration reduced to 1.5 seconds from 4.\n\nAn ally in danger will be automatically saved by Dark Passage, without them needing to click on the lantern.\n\nDark Energy Flay Dark Energy Flay\n\nCooldown reduced and mana cost removed.\n\nThe passive bonus magic damage builds up in only 4 seconds after your last basic attack and hits harder.\n\nThrows enemies much farther based on their missing health, cooldown reduced.\n\nThe Box The Box\n\nAbility removed. Not available on the Cosmic Ruins because Thresh doesn't need his box to end the universe."
        "url": "https://static.wikia.nocookie.net/leagueoflegends/images/9/94/FGM_Dark_Star_Singularity.png/revision/latest?cb=20180610011014"
    },
    {
        "gameMode": "NEXUS BLITZ",
        "description": "Nexus Blitz (Project SLIME) is an experimental mode that ran from July 31st to September 11th, 2018. It started being playable for alpha testing on live servers on patch V8.16.\n\nOn June 23rd, 2020 (public beta patch V10.14), Nexus Blitz was brought back on public testing servers with new visuals of the Ionian Spirit Blossom Forests known as the Nexus Blitz icon Temple of Lily and Lotus. The game mode was available from July 22nd, 2020 (11:59 PM PDT) till August 24th, 2020 (11:59 PM PDT)"
        "url": "https://static.wikia.nocookie.net/leagueoflegends/images/0/01/Nexus_Blitz_Beta_Promo.jpg/revision/latest?cb=20180901134223"
    },
    {
        "gameMode": "ODYSSEY",
        "description": "Odyssey: Extraction was a temporary game mode released for the Odyssey event that was available from September 12th to October 8th, 2018.\n\nThe game mode also featured its own Announcer pack, voiced by the characters that appear in the Odyssey universe (Odyssey Jinx Odyssey Jinx, Odyssey Malphite Odyssey Malphite, Odyssey Sona Odyssey Sona, Odyssey Yasuo Odyssey Yasuo, Odyssey Ziggs Odyssey Ziggs and Odyssey Kayn Odyssey Kayn).\n\nOverview\n\nPLAYERS: 5\n\nMAP: Crash Site\n\nMODE TYPE: 5 player co-op battle.\n\nWIN CONDITION: Defeat a series of monsters, culminating into a large Boss Fight against Odyssey Kayn Odyssey Kayn.\n\nThe Odyssey game mode is released with five different queues (from easiest to hardest):\n\nIntro\n\nCadet\n\nCrewmember\n\nCaptain\n\nOnslaught\n\nYou can start playing on the lowest difficulty (Intro), and to unlock following difficulties you have to win a game on the previous difficulty or join a friend that already has done so.\n\nChampion Select\n\nIn this gamemode you can only play as an Odyssey champion. All the Odyssey champions are available (excluding Kayn Kayn), and when selecting a champion the Odyssey skin is automatically selected. When a champion is selected more than once, each same champion has a different chroma.\n\nJinx Jinx\n\nMalphite Malphite\n\nSona Sona\n\nYasuo Yasuo\n\nZiggs Ziggs\n\nSummoner spells & Runes\n\nExclusive to this gamemode are two available summoner spells, Resuscitate Resuscitate and Warp Warp. In this game mode, you do not have access to runes, instead you can edit your Augments.\n\nAugments\n\nEach time you play the mode, you can earn augments for the characters. You keep these for the duration of the event and equip them between games. Augments have various powerful effects.\n\nYou unlock extra augment slots as you complete missions over time. You can get up to 5 slots and 15 augments per character.\n\nEach champion has passive augment (innate bonuses) that takes one slot and that cannot be removed.\n\nA 'catch-up' augment bundle is available from September 17 – October 8. The bundle includes all augments for either 600 RP 600 or 10,000 BE 10,000, but each augment owned reduces the RP price by 8, down to a minimum price of 215 RP 215."
        "url": "https://static.wikia.nocookie.net/leagueoflegends/images/e/e8/FGM_Odyssey_Extraction.png/revision/latest?cb=20180913115656"
    },
    {
        "gameMode": "ULTIMATE SPELLBOOK",
        "description": "Ultimate Spellbook is a Featured Game Mode in League of Legends icon League of Legends. Played on Summoner's Rift icon Summoner's Rift, players each choose between 1 of 4 random ultimates to replace one of their summoner spells.\n\nPlayers will queue up in a blind pick style champion select.\n\nAll players have a Placeholder Ult-ernate Placeholder Ult-ernate Summoner Spell that cannot be swapped out with another summoner spell. Junglers instead have a Placeholder and Attack-Smite Placeholder and Attack-Smite.\n\nYou will be given 30 seconds to choose from a pool of 4 ultimates at the start of the match.\n\nIf you do not confirm to take the ultimate you have selected, that ultimate will be taken automatically.\n\nThe first ultimate is always selected.\n\nAfter some time, the ultimate you picked takes the place of your Placeholder Ult-ernate Placeholder Ult-ernate Summoner Spell for the rest of the game, and you cannot change it.\n\nYou can still rank up your own champion's ultimate.\n\nAll Ult-ernate Summoner Spells do not have resource costs and have an initial cooldown of 130 seconds, increased to 210 if you have Attack-Smite.\n\nThese ultimates can be used even before reaching level 6.\n\nAll players have 70 summoner spell haste, 160 − 330 (based on level) bonus health, 15% Tenacity icon Tenacity and 40 bonus movement speed out-of-combat.\n\nYou can see everyone's chosen Ult-ernate Summoner Spells on both the scoreboard and next to their health bar.\n\nYou start at level 3 and with 950 Gold 950.\n\nPassive experience and gold are increased and you share Minion icon minion gold with teammates in lane.\n\nSlaying epic Monster icon monsters grants a buff that deals 0.3% maximum health magic damage once every second against turrets whenever you damage them.\n\nTurret Platings Turret Platings fall off at 9:00.\n\nRift Herald Rift Herald spawns at 6:00.\n\nSlaying Baron Nashor Baron Nashor leaves behind an Eye of the Herald Eye of the Herald.\n\nUnsealed Spellbook Unsealed Spellbook is disabled in this mode.\n\nAttack-Smite\n\nJunglers have Placeholder and Attack-Smite 'Placeholder and Attack-Smite' instead of Placeholder Ult-ernate Placeholder Ult-ernate Summoner Spell in champion select. Attack-Smite gets replaced by the Ult-ernate Summoner Spell that they select at the beginning of the game, granting a buff that is also called Attack-Smite.\n\nAttack-Smite: Causes basic attacks against Blue Sentinel Blue Sentinel, Red Brambleback Red Brambleback, Rift Scuttler Rift Scuttler, or epic Monster icon monsters while they are below 450 health to deal 450 bonus true damage.\n\nOnly affects the Blue Sentinel Blue Sentinel and Red Brambleback Red Brambleback within the user's respective side of the jungle.\n\nWhen Ivern Ivern takes Attack-Smite, he will not be able to use it to bypass Friend of the Forest's Friend of the Forest's grove maturation timer. However, freeing a qualifying jungle camp will trigger Attack-Smite, granting him the heal and jungle starter item stack that a regular Smite Smite would."
        "url": "https://static.wikia.nocookie.net/leagueoflegends/images/a/a3/Ultimate_Spellbook_ulternate_spell_selection.png/revision/latest?cb=20220714001317"
    }
]
